In [1]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [2]:
df = DataFrame(np.random.randint(2,12,12).reshape(3,4),columns = [x for x in 'ABCD'])

In [3]:
df

   A  B  C  D
0  6  5  4  8
1  9  2  5  7
2  5  9  6  4

In [4]:
def dif(x):
    if x['A'] - x['D'] <2:
        return True
    else:
        return False

In [5]:
df.apply(dif,axis = 1)

0     True
1    False
2     True
dtype: bool

In [6]:
df.index = [x for x in 'abc']

In [7]:
df['E'] = df.apply(dif,axis = 1)

In [8]:
df

   A  B  C  D      E
a  6  5  4  8   True
b  9  2  5  7  False
c  5  9  6  4   True

In [2]:
df1 = DataFrame(np.random.randn(6,3))

In [4]:
df1.iloc[4:,1] ='NA'

In [6]:
df1.iloc[2:2] = 'NA'

In [7]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
....: 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [9]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [10]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
....: 'Pastrami', 'corned beef', 'Bacon',
....: 'pastrami', 'honey ham', 'nova lox'],
....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [11]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [12]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [13]:
lowcase = data['food'].str.lower()

In [14]:
data['animal'] = lowcase.map(meat_to_animal)

In [15]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [17]:
data['animal2'] = data['food'].map(lambda x:meat_to_animal[x.lower()])

In [18]:
data

          food  ounces  animal animal2
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

In [19]:
data = DataFrame(np.random.randn(1000,4))

In [22]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
110 -0.186594  3.006959 -0.959809 -0.678166
208  3.122630  0.170921  0.170548 -0.847929
260  0.029391 -3.431100  1.384072 -1.063157
306  0.021091 -0.469887  3.065293  0.630554
313  0.236301 -0.654222 -3.652350 -1.469955
356 -1.150407 -0.567521  3.158359  0.478558
536  3.070616 -0.139604  0.269772 -0.516547
570 -1.374738  3.059668  0.034752  1.287602
606  0.079157 -0.216869  2.499285  3.356236
741  0.629785 -0.191731 -3.317605  0.369961
766 -0.551131 -0.756916  2.068926  3.668962
852 -0.139150  3.021884  0.361409  0.226327
947  0.105281  3.515428  0.306175 -1.905151

In [23]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [24]:
sample = np.random.permutation(5)

In [25]:
sample

array([2, 0, 3, 4, 1])

In [26]:
df.take(sample)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7

In [ ]:
df.sample()

In [2]:
df = DataFrame(np.arange(6).reshape((2, 3)),
.....: index=pd.Index(['Ohio', 'Colorado'], name='state'),
.....: columns=pd.Index(['one', 'two', 'three'],
.....: name='number'))

In [3]:
df

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [9]:
s1 = df.stack()

In [10]:
s1.index

MultiIndex(levels=[['Ohio', 'Colorado'], ['one', 'two', 'three']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]],
           names=['state', 'number'])

In [11]:
s1.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [12]:
data = pd.read_csv('..\pydata-book\examples\macrodata.csv')

In [14]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [15]:
periods = pd.PeriodIndex(year = data.year,quarter = data.quarter)

In [16]:
columns = ['realgdp','realcons','realgovt']

In [17]:
data = data[columns]

In [19]:
data.index = periods.to_timestamp(freq = 'D',how = 'end')

In [20]:
data.head()

             realgdp  realcons  realgovt
1959-03-31  2710.349    1707.4   470.045
1959-06-30  2778.801    1733.7   481.301
1959-09-30  2775.488    1751.8   491.260
1959-12-31  2785.204    1753.7   484.052
1960-03-31  2847.699    1770.5   462.199

In [25]:
ldata = data.stack().reset_index().rename(columns = {0:'value','level_0':'date','level_1':'item'})

In [34]:
pivoted = ldata.pivot(index = 'date',columns = 'item',values = 'value')

In [35]:
ldata['value2'] = np.random.randn(len(ldata))

In [36]:
pivoted2 = ldata.pivot('date','item')

In [37]:
pivoted2.head()

              value                       value2
item       realcons   realgdp realgovt  realcons   realgdp  realgovt
date
1959-03-31   1707.4  2710.349  470.045  0.467892  0.950127 -1.511432
1959-06-30   1733.7  2778.801  481.301  1.340313  0.691725 -0.935207
1959-09-30   1751.8  2775.488  491.260 -2.276308 -0.084871 -0.425502
1959-12-31   1753.7  2785.204  484.052 -1.257461 -0.807042 -0.024729
1960-03-31   1770.5  2847.699  462.199  0.925906 -0.201474  0.432715

In [38]:
pivoted2.melt(value_vars = ['value'])

       NaN      item     value
0    value  realcons  1707.400
1    value  realcons  1733.700
2    value  realcons  1751.800
3    value  realcons  1753.700
4    value  realcons  1770.500
5    value  realcons  1792.900
6    value  realcons  1785.800
7    value  realcons  1788.200
8    value  realcons  1787.700
9    value  realcons  1814.300
10   value  realcons  1823.100
11   value  realcons  1859.600
12   value  realcons  1879.400
13   value  realcons  1902.500
14   value  realcons  1917.900
15   value  realcons  1945.100
16   value  realcons  1958.200
17   value  realcons  1976.900
18   value  realcons  2003.800
19   value  realcons  2020.600
20   value  realcons  2060.500
21   value  realcons  2096.700
22   value  realcons  2135.200
23   value  realcons  2141.200
24   value  realcons  2188.800
25   value  realcons  2213.000
26   value  realcons  2251.000
27   value  realcons  2314.300
28   value  realcons  2348.500
29   value  realcons  2354.500
..     ...       ...       ...
579  value  realgovt   774.408
580  value  realgovt   786.673
581  value  realgovt   799.967
582  value  realgovt   800.196
583  value  realgovt   838.775
584  value  realgovt   839.598
585  value  realgovt   845.722
586  value  realgovt   856.570
587  value  realgovt   861.440
588  value  realgovt   876.385
589  value  realgovt   865.596
590  value  realgovt   869.204
591  value  realgovt   870.044
592  value  realgovt   890.394
593  value  realgovt   875.557
594  value  realgovt   900.511
595  value  realgovt   892.839
596  value  realgovt   892.002
597  value  realgovt   894.404
598  value  realgovt   882.766
599  value  realgovt   898.713
600  value  realgovt   918.983
601  value  realgovt   925.110
602  value  realgovt   943.372
603  value  realgovt   961.280
604  value  realgovt   991.551
605  value  realgovt  1007.273
606  value  realgovt   996.287
607  value  realgovt  1023.528
608  value  realgovt  1044.088

[609 rows x 3 columns]